#Использовать "../vendor/oscript-library/src/v8runner"
#Использовать "../vendor/oscript-library/src/tempfiles"

Перем Лог;
Перем КодВозврата;

Процедура Инициализация()

	Лог = Логирование.ПолучитьЛог("oscript.app.gitlab-test_CanCompile");
	Лог.УстановитьРаскладку(ЭтотОбъект);
	
	КодВозврата = 0;

КонецПроцедуры

Функция Форматировать(Знач Уровень, Знач Сообщение) Экспорт

    Возврат СтрШаблон("%1: %2 - %3", ТекущаяДата(), УровниЛога.НаименованиеУровня(Уровень), Сообщение);

КонецФункции

Процедура ВыполнитьТест()

	Конфигуратор = Новый УправлениеКонфигуратором();

	ПараметрыЗапуска = Конфигуратор.ПолучитьПараметрыЗапуска();
	КомандаЗапуска = "/LoadConfigFromFiles ""%1""";
	КомандаЗапуска = СтрШаблон(КомандаЗапуска, ТекущийКаталог() + "\src\cf");

	Лог.Информация("Команда обновления конфигурации: " + КомандаЗапуска);

	ПараметрыЗапуска.Добавить(КомандаЗапуска);

	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
	Исключение

	    Лог.Ошибка(Конфигуратор.ВыводКоманды());
	    КодВозврата = 1;

	КонецПопытки;

	УдалитьФайлы(Конфигуратор.ПутьКВременнойБазе());

КонецПроцедуры

Инициализация();
ВыполнитьТест();

ЗавершитьРаботу(КодВозврата);
